ellak/docs/misc/sample_soap_req

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/" xmlns:par="http://parameters.services.gsisws/">
   <soapenv:Header>
	<wsse:Security xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd" soapenv:mustUnderstand="1">
		<wsse:UsernameToken xmlns:wsu="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-utility-1.0.xsd" wsu:Id="USRToken">
			<wsse:Username>gsis</wsse:Username>
			<wsse:Password Type="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-username-token-profile-1.0#PasswordText">gsis</wsse:Password>
		</wsse:UsernameToken>
	</wsse:Security>
   </soapenv:Header>
   <soapenv:Body>
      <par:queryByTaxIdRequest>
         <par:taxId>001010105</par:taxId>
      </par:queryByTaxIdRequest>
   </soapenv:Body>
</soapenv:Envelope>